<?php
$title = 'История марки BMW';
$content = "BMW AG — производитель автомобилей, мотоциклов, двигателей и велосипедов со штаб-квартирой в Мюнхене,
 Германия. Компания владеет брендами Mini и Rolls-Royce. Она входит в тройку немецких производителей премиальных авто,
  которые лидируют по объемам продаж во всем мире. <br> <br>

В 1913 году в Мюнхене Карлом Раппом и Густавом Отто основаны две небольшие авиамоторные фирмы.
 После начала Первой мировой войны потребность в их продукции резко возросла, 
 и владельцы двух компаний решили объединиться. Так в 1917 году появилась фирма под названием
  Bayerische MotorenWerke («Баварские моторные заводы»).";

$date = date('Y');

?>

<h1><?=$title?></h1>
<p><?="$content<hr>"?></p>
<footer><?="Copyright {$date}"?></footer>
